Tekla Open API Reference for Tekla Structures 2025
AngleList.Parse Method
Overload List
Name | Description
Parse(String)
 Parses the given text as an angle list in the current unit type
Parse(String, IFormatProvider)
 Parses the given text as an angle list in the current unit type
Parse(String, IFormatProvider, Angle.UnitType)
 Parses the given text as an angle list in the current unit type
Top
See Also
Reference
AngleList Class
Tekla.Structures.Datatype Namespace